; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 12 parts and 200% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    red green mauve black white blue - acolour
    cherry beech oak - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - part
    b0 b1 b2 b3 b4 b5 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (boardsize-successor s10 s11)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 blue)
    (has-colour glazer0 red)
    (has-colour glazer1 white)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher0 green)
    (has-colour immersion-varnisher0 blue)
    (has-colour immersion-varnisher1 black)
    (has-colour immersion-varnisher1 green)
    (has-colour immersion-varnisher1 red)
    (has-colour immersion-varnisher1 white)
    (has-colour spray-varnisher0 black)
    (has-colour spray-varnisher0 green)
    (has-colour spray-varnisher1 black)
    (has-colour spray-varnisher1 blue)
    (has-colour spray-varnisher1 green)
    (has-colour spray-varnisher1 white)
    (has-colour spray-varnisher1 red)
    (available p0)
    (treatment p0 colourfragments)
    (surface-condition p0 verysmooth)
    (wood p0 beech)
    (colour p0 black)
    (goalsize p0 medium)
    (= (spray-varnish-cost p0) 10)
    (= (glaze-cost p0) 15)
    (= (grind-cost p0) 30)
    (= (plane-cost p0) 20)
    (unused p1)
    (goalsize p1 medium)
    (= (spray-varnish-cost p1) 10)
    (= (glaze-cost p1) 15)
    (= (grind-cost p1) 30)
    (= (plane-cost p1) 20)
    (unused p2)
    (goalsize p2 small)
    (= (spray-varnish-cost p2) 5)
    (= (glaze-cost p2) 10)
    (= (grind-cost p2) 15)
    (= (plane-cost p2) 10)
    (unused p3)
    (goalsize p3 large)
    (= (spray-varnish-cost p3) 15)
    (= (glaze-cost p3) 20)
    (= (grind-cost p3) 45)
    (= (plane-cost p3) 30)
    (unused p4)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (unused p6)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 medium)
    (= (spray-varnish-cost p7) 10)
    (= (glaze-cost p7) 15)
    (= (grind-cost p7) 30)
    (= (plane-cost p7) 20)
    (unused p8)
    (goalsize p8 large)
    (= (spray-varnish-cost p8) 15)
    (= (glaze-cost p8) 20)
    (= (grind-cost p8) 45)
    (= (plane-cost p8) 30)
    (unused p9)
    (goalsize p9 large)
    (= (spray-varnish-cost p9) 15)
    (= (glaze-cost p9) 20)
    (= (grind-cost p9) 45)
    (= (plane-cost p9) 30)
    (unused p10)
    (goalsize p10 large)
    (= (spray-varnish-cost p10) 15)
    (= (glaze-cost p10) 20)
    (= (grind-cost p10) 45)
    (= (plane-cost p10) 30)
    (unused p11)
    (goalsize p11 large)
    (= (spray-varnish-cost p11) 15)
    (= (glaze-cost p11) 20)
    (= (grind-cost p11) 45)
    (= (plane-cost p11) 30)
    (boardsize b0 s10)
    (wood b0 cherry)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s10)
    (wood b1 cherry)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s11)
    (wood b2 oak)
    (surface-condition b2 smooth)
    (available b2)
    (boardsize b3 s7)
    (wood b3 oak)
    (surface-condition b3 rough)
    (available b3)
    (boardsize b4 s10)
    (wood b4 beech)
    (surface-condition b4 rough)
    (available b4)
    (boardsize b5 s4)
    (wood b5 beech)
    (surface-condition b5 rough)
    (available b5)
  )
  (:goal
    (and
    (available p0)
    (surface-condition p0 verysmooth)
    (treatment p0 varnished)
    (available p1)
    (surface-condition p1 verysmooth)
    (treatment p1 varnished)
    (wood p1 cherry)
    (available p2)
    (surface-condition p2 smooth)
    (wood p2 oak)
    (available p3)
    (colour p3 blue)
    (surface-condition p3 verysmooth)
    (available p4)
    (treatment p4 glazed)
    (wood p4 beech)
    (available p5)
    (surface-condition p5 verysmooth)
    (colour p5 black)
    (treatment p5 varnished)
    (wood p5 cherry)
    (available p6)
    (colour p6 white)
    (surface-condition p6 verysmooth)
    (wood p6 oak)
    (available p7)
    (colour p7 green)
    (surface-condition p7 verysmooth)
    (treatment p7 varnished)
    (wood p7 beech)
    (available p8)
    (treatment p8 varnished)
    (wood p8 cherry)
    (available p9)
    (colour p9 red)
    (surface-condition p9 smooth)
    (available p10)
    (surface-condition p10 smooth)
    (wood p10 cherry)
    (available p11)
    (surface-condition p11 verysmooth)
    (treatment p11 varnished)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-medium b5 p7 saw0 beech rough s4 s3 s2)
   deleted: (unused p7)
   added: (available p7) (wood p7 beech) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b5 s2)
   goals met: 4 of 42
2. (do-saw-medium b4 p4 saw0 beech rough s10 s9 s8)
   deleted: (unused p4)
   added: (available p4) (wood p4 beech) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b4 s8)
   goals met: 6 of 42
3. (do-saw-medium b2 p6 saw0 oak smooth s11 s10 s9)
   deleted: (unused p6)
   added: (available p6) (wood p6 oak) (surface-condition p6 smooth) (colour p6 natural) (treatment p6 untreated) (boardsize b2 s9)
   goals met: 8 of 42
4. (do-saw-medium b1 p5 saw0 cherry rough s10 s9 s8)
   deleted: (unused p5)
   added: (available p5) (wood p5 cherry) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b1 s8)
   goals met: 10 of 42
5. (do-saw-medium b0 p1 saw0 cherry rough s10 s9 s8)
   deleted: (unused p1)
   added: (available p1) (wood p1 cherry) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s8)
   goals met: 12 of 42
6. (do-saw-large b2 p9 saw0 oak smooth s9 s7 s8 s6)
   deleted: (unused p9)
   added: (available p9) (wood p9 oak) (surface-condition p9 smooth) (colour p9 natural) (treatment p9 untreated) (boardsize b2 s6)
   goals met: 14 of 42
7. (do-saw-large b2 p3 saw0 oak smooth s6 s4 s5 s3)
   deleted: (unused p3)
   added: (available p3) (wood p3 oak) (surface-condition p3 smooth) (colour p3 natural) (treatment p3 untreated) (boardsize b2 s3)
   goals met: 15 of 42
8. (do-saw-large b2 p11 saw0 oak smooth s3 s1 s2 s0)
   deleted: (unused p11)
   added: (available p11) (wood p11 oak) (surface-condition p11 smooth) (colour p11 natural) (treatment p11 untreated) (boardsize b2 s0)
   goals met: 16 of 42
9. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 16 of 42
10. (do-plane p5 planer0 rough natural untreated)
   deleted: (surface-condition p5 rough)
   added: (surface-condition p5 smooth)
   goals met: 16 of 42
11. (do-plane p1 planer0 rough natural untreated)
   deleted: (surface-condition p1 rough)
   added: (surface-condition p1 smooth)
   goals met: 16 of 42
12. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 17 of 42
13. (do-grind p6 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p6 smooth)
   added: (surface-condition p6 verysmooth)
   goals met: 18 of 42
14. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 19 of 42
15. (do-grind p3 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p3 smooth)
   added: (surface-condition p3 verysmooth)
   goals met: 20 of 42
16. (do-grind p11 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p11 smooth)
   added: (surface-condition p11 verysmooth)
   goals met: 21 of 42
17. (do-grind p1 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p1 smooth)
   added: (surface-condition p1 verysmooth)
   goals met: 22 of 42
18. (do-grind p0 grinder0 verysmooth black colourfragments untreated)
   deleted: (treatment p0 colourfragments) (colour p0 black)
   added: (treatment p0 untreated) (colour p0 natural)
   goals met: 22 of 42
19. (do-glaze p9 glazer0 red)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 red)
   goals met: 23 of 42
20. (do-glaze p6 glazer1 white)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 glazed) (colour p6 white)
   goals met: 24 of 42
21. (do-glaze p4 glazer0 blue)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 glazed) (colour p4 blue)
   goals met: 25 of 42
22. (do-glaze p3 glazer0 blue)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 blue)
   goals met: 26 of 42
23. (do-immersion-varnish p0 immersion-varnisher0 black verysmooth)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 varnished) (colour p0 black)
   goals met: 27 of 42
24. (do-immersion-varnish p1 immersion-varnisher0 black verysmooth)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 varnished) (colour p1 black)
   goals met: 28 of 42
25. (do-immersion-varnish p11 immersion-varnisher0 black verysmooth)
   deleted: (treatment p11 untreated) (colour p11 natural)
   added: (treatment p11 varnished) (colour p11 black)
   goals met: 29 of 42
26. (do-immersion-varnish p5 immersion-varnisher0 black verysmooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 black)
   goals met: 31 of 42
27. (do-immersion-varnish p7 immersion-varnisher0 green verysmooth)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 varnished) (colour p7 green)
   goals met: 33 of 42
28. (do-saw-large b0 p10 saw0 cherry rough s8 s6 s7 s5)
   deleted: (unused p10)
   added: (available p10) (wood p10 cherry) (surface-condition p10 rough) (colour p10 natural) (treatment p10 untreated) (boardsize b0 s5)
   goals met: 35 of 42
29. (do-plane p10 planer0 rough natural untreated)
   deleted: (surface-condition p10 rough)
   added: (surface-condition p10 smooth)
   goals met: 36 of 42
30. (do-saw-large b0 p8 saw0 cherry rough s5 s3 s4 s2)
   deleted: (unused p8)
   added: (available p8) (wood p8 cherry) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b0 s2)
   goals met: 38 of 42
31. (do-plane p8 planer0 rough natural untreated)
   deleted: (surface-condition p8 rough)
   added: (surface-condition p8 smooth)
   goals met: 38 of 42
32. (do-immersion-varnish p8 immersion-varnisher0 black smooth)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 varnished) (colour p8 black)
   goals met: 39 of 42
33. (do-saw-small b3 p2 saw0 oak rough s7 s6)
   deleted: (unused p2)
   added: (available p2) (wood p2 oak) (surface-condition p2 rough) (colour p2 natural) (treatment p2 untreated) (boardsize b3 s6)
   goals met: 41 of 42
34. (do-plane p2 planer0 rough natural untreated)
   deleted: (surface-condition p2 rough)
   added: (surface-condition p2 smooth)
   goals met: 42 of 42
